Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion
Provides information about the version of the currently running API and Runtime

Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.ApiMajor
Major version number for the Navisworks API.
Changes when a non-backwards compatible change is made to a stable version of the API.
Always less than or equal to Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.RuntimeMajor.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.ApiMinor
Minor version number for the Navisworks API.
Changes when there is a behavioral or minor change to a stable version of the API
that may have an impact on backwards compatibility.
Always less than or equal to Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.RuntimeMinor.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.Build
Build number for Api and Runtime. Changes on every build (and hence every release).

Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.IsApiStable
Is this version of the API stable ? If false, breaking changes may be made at any time and client
code must be recompiled for every build. Api will be unstable for alpha and early beta releases.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.IsRuntimeBeta
Is this an alpha or beta version of the runtime ?

Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.Runtime
Identifies the Navisworks runtime that is providing this implementation of the API. Will typically
be an installed Navisworks product.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.RuntimeLanguage
Gets the language code corresponding to the one Navisworks is using.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.RuntimeMajor
Major version number for the current Navisworks Runtime.
This changes with every major (annual) release of Navisworks products.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.RuntimeMinor
Minor version number for the current Navisworks Runtime.
This changes with every minor (service pack or subscription release) update of Navisworks products.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationVersion.RuntimeProductName
The complete product name for the Navisworks runtime that is providing
this implementation of the API.